//-----------------------------------------------------------------------------
/*
 File        : PictureRes.h
 Version     : V1.10
 By          : 银网科技

 Description :各种图片资源
        
 Date       : 2023.12.05
*/
//-----------------------------------------------------------------------------
#ifndef GUI_PICTURE_RES_H
#define GUI_PICTURE_RES_H

#include "GUI.h"

#include "GUIPicture.h"
#include "GUIBitmap.h"

#include <GUI_Type.h>
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
#ifdef __cplusplus
extern "C" {
#endif
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------

extern const GUI_BITMAP bmSGLOGO_200X43;

extern const TGUIPicture picSGLogo200x43C565bmp;
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// 用于MessageBox的4个图标
//-----------------------------------------------------------------------------
// i号 - 用于提示类提示
// 颜色：16位 565格式
// 尺寸：64x64
extern const TGUIPicture picInfoMark64x64C565bmp;
//-----------------------------------------------------------------------------
// 问号 - 用于询问类提示
// 颜色：16位 565格式
// 尺寸：64x64
extern const TGUIPicture picQuestMark64x64C565bmp;
//-----------------------------------------------------------------------------
// 叹号 - 用于警告类提示
// 颜色：16位 565格式
// 尺寸：64x64
extern const TGUIPicture picExclMark63x56C565bmp;
//-----------------------------------------------------------------------------
// 阻止号 - 用于错误提示
// 颜色：16位 565格式
// 尺寸：64x64
extern const TGUIPicture picStopMark64x64C565bmp;
//-----------------------------------------------------------------------------
// 禁止号 - 用于错误提示
// 颜色：16位 565格式
// 尺寸：32x32
extern const TGUIPicture picForbidMark32x32C565bmp;
//-----------------------------------------------------------------------------
// 钥匙
extern const TGUIPicture picKey99x77G32jpg;
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// 用于主页状态指示的图片
//-----------------------------------------------------------------------------
// 电池图标
extern const TGUIPicture picBatteryNormal45x72jpg;
extern const TGUIPicture picBatteryCharge45x72jpg;
//-----------------------------------------------------------------------------
// 交流输入图标
// 交流输入正常
extern const TGUIPicture picACPowerBlue60x72jpg;
// 交流输入失效
extern const TGUIPicture picACPowerGray60x72jpg;
//-----------------------------------------------------------------------------
// 逆变器状态图标
extern const TGUIPicture picInverter80x72jpg;
extern const TGUIPicture picInverter66x72jpg;
//-----------------------------------------------------------------------------
// 断路器状态图标
extern const TGUIPicture picBreaker76x80jpg;
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// 制冷器图标
extern const TGUIPicture picCooler32x32jpg;
// 加热器图标
extern const TGUIPicture picHeater32x32jpg;

//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// 16x16指示灯
extern const TGUIPicture picLEDGreenOn16x16bmp;
extern const TGUIPicture picLEDRedOn16x16bmp;
extern const TGUIPicture picLEDOangeOn16x16bmp;
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
extern const TGUIPicture picCvBkg1320x240jpg;
//-----------------------------------------------------------------------------
#ifdef __cplusplus
}
#endif
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
#endif // GUI_PICTURE_RES_H
