//-----------------------------------------------------------------------------
/*
 File        : ADCMgr.h
 Version     : V1.10
 By          : 银网科技

 Toolchain   : 
                 RealView Microcontroller Development Kit (MDK)
                 Keil uVision
 Description :管理ADC过程
        
 Date       : 2023.12.05
*/
//-----------------------------------------------------------------------------
#ifndef __ADCMGR_H
#define __ADCMGR_H

#include <stdint.h>
//-----------------------------------------------------------------------------
#ifdef __cplusplus
extern "C" {
#endif
//=============================================================================
// 全局宏
//-----------------------------------------------------------------------------
#define ADC_NbrOfConversion     16
//-----------------------------------------------------------------------------
#define ADCH_VACin      ADC_CHANNEL_10
#define ADCH_VACout     ADC_CHANNEL_11
  
#define ADCH_Temp       ADC_CHANNEL_0
//=============================================================================
// 全局数据
//-----------------------------------------------------------------------------
// ADC的DMA结果区
// 在三重 ADC 模式下，发出第一个请求时传输 ADC1 的数据，发出第二个请求时传输    
// ADC2 的数据，发出第三个请求时传输 ADC3 的数据；重复此序列。因此 DMA 首先     
// 传输 ADC1 的数据，随后传输 ADC2 的数据，再传输 ADC3 的数据，依次类推。
// DMA 模式 1 用于三重规则同时模式。
// 示例：
//   三重规则同时模式：生成 3 个连续的 DMA 请求（每个请求对应一个转换数据项）
//       第 1 个请求：ADC_CDR[31:0] = ADC1_DR[15:0]
//       第 2 个请求：ADC_CDR[31:0] = ADC2_DR[15:0]
//       第 3 个请求：ADC_CDR[31:0] = ADC3_DR[15:0]
//       第 4 个请求：ADC_CDR[31:0] = ADC1_DR[15:0]
extern volatile uint16_t FuADCSamples[ADC_NbrOfConversion][3];

// 采样通道定义
extern const uint8_t FucADCChannels[ADC_NbrOfConversion][3];
//=============================================================================
// 全局方法
//-----------------------------------------------------------------------------
// 初始化
void ADCMGR_Init(void);
//-----------------------------------------------------------------------------
// 启动采样
void ADCMGR_Start(void);
//-----------------------------------------------------------------------------
// 由启动采样
void ADC_Startup(void);
//-----------------------------------------------------------------------------
// 停止采样
void ADCMGR_Stop(void);
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// 读锂电池测量
void ADCMDR_ReadBatMeasure(void);
//-----------------------------------------------------------------------------
// 读RTC测量
void ADCMDR_ReadRTCMeasure(void);
//=============================================================================
#ifdef __cplusplus
}
#endif
//-----------------------------------------------------------------------------
#endif
