//-----------------------------------------------------------------------------
/*
 File        : IndLED.c
 Version     : V1.10
 By          : 银网科技

 Description :指示灯管理
        
 Date       : 2023.12.05

 2024/10/02 Wey
   v2.1
     适配HWv2.0
*/
//-----------------------------------------------------------------------------
#include "IndLed.h"

#include "gpio.h"

//#include "InfoCache.h"

#include "cmsis_os.h"
#include "stm32f4xx_hal.h"

#include <string.h>
//=============================================================================
// 本地宏
//-----------------------------------------------------------------------------
// 指示灯
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// 通讯灯亮的持续时间
#define CMLED_DELAY   200
//=============================================================================
// 本地数据结构
//-----------------------------------------------------------------------------

//=============================================================================
// 本地数据
//-----------------------------------------------------------------------------
static uint16_t m_FuwCommLEDCntr;
//=============================================================================
// 公用方法
//-----------------------------------------------------------------------------
// 初始化
void INDLED_Init(void)
{
  
  m_FuwCommLEDCntr = 0;
}
//-----------------------------------------------------------------------------
// 更新面板指示灯
void INDLED_SetLamps( uint32_t uLamps )
{
  
  uint32_t uMask = 1;
  for( int iIdx = 0; iIdx < NUM_LAMPS; iIdx++ )
    {
    INDLED_Set( iIdx, uMask & uLamps );

    uMask <<= 1;
    }
}
//-----------------------------------------------------------------------------
// 通讯灯关闭倒计时
void INDLED_CommLEDCntr(void)
{
  
  if( m_FuwCommLEDCntr > 0 )
    {
    --m_FuwCommLEDCntr;
    }
}
//-----------------------------------------------------------------------------
// 液晶背光
void INDLED_LCDBG( int iOn )
{
  
  if( 0 != iOn )
    LCD_Lamp_ON;
  else
    LCD_Lamp_OFF;
}
//-----------------------------------------------------------------------------
// 获取液晶背光状态
bool INDLED_GetLCDBG()
{
  
  return (0 != LCD_Lamp_State );
}
//-----------------------------------------------------------------------------
// 设置指示灯的状态
void INDLED_Set( int iLed, int iOn )
{

  switch( iLed )
    {
    case 0:
      {
      if( 0 == iOn )
        LED1_OFF;
      else
        LED1_ON;
      break;
      }
    case 1:
      {
      if( 0 == iOn )
        LED2_OFF;
      else
        LED2_ON;
      break;
      }
    case 2:
      {
      if( 0 == iOn )
        LED3_OFF;
      else
        LED3_ON;
      break;
      }
    case 3:
      {
      if( 0 == iOn )
        LED4_OFF;
      else
        LED4_ON;
      break;
      }
    case 4:
      {
      if( 0 == iOn )
        LED5_OFF;
      else
        LED5_ON;
      break;
      }
    case 5:
      {
      if( 0 == iOn )
        LED6_OFF;
      else
        LED6_ON;
      break;
      }
    case 6:
      {
      if( 0 == iOn )
        LED7_OFF;
      else
        LED7_ON;
      break;
      }
    case 7:
      {
      if( 0 == iOn )
        LED8_OFF;
      else
        LED8_ON;
      break;
      }
    case 8:
      {
      if( 0 == iOn )
        LED9_OFF;
      else
        LED9_ON;
      break;
      }
    case 9:
      {
      if( 0 == iOn )
        LED10_OFF;
      else
        LED10_ON;
      break;
      }
    }
}
//-----------------------------------------------------------------------------
