//-----------------------------------------------------------------------------
/*
 File        : MB85RSxx.h
 Version     : V1.10
 By          : 银网科技
 Description :MB85RSxx/FM25Lxx铁电IC驱动函数
 Date       : 2023.12.05
*/
//-----------------------------------------------------------------------------
#ifndef __MB85RSxx_H
#define __MB85RSxx_H

#include "Dev_Cfg.h"

#include <stdint.h>
//-----------------------------------------------------------------------------
#ifdef __cplusplus
extern "C" {
#endif
//-----------------------------------------------------------------------------
// 全局宏
//-----------------------------------------------------------------------------
#define EM25RS16        2048
#define EM25RS64        8192
#define EM25RS128       16384
#define EM25RS256       32768
#define EM25RS1M      131072
#define EM25RS2M      262144  
//-----------------------------------------------------------------------------
// FeRAM的容量
#define FeRAM_SIZE     EM25RS128
//-----------------------------------------------------------------------------
#define TOKEN_WriteFeRAM_Enabled   0xAA3C55C3
//-----------------------------------------------------------------------------
// 全局方法
//-----------------------------------------------------------------------------
//初始化IIC
void MB85RSxx_Init(void);
//-----------------------------------------------------------------------------
//指定地址开始读取指定长度数据，最长四字节，按MSB组合成long 
int  MB85RSxx_ReadDWord(uint32_t  uwReadAddr,
                        uint32_t *puData,
                        uint8_t   ucLen);
//-----------------------------------------------------------------------------
//从指定地址开始读出指定长度的数据         
int MB85RSxx_Read    (uint32_t  uReadAddr,
                         void  *pvBuffer,   
                      uint32_t  uNumBytes);       
void MB85RSxx_DMARead(uint32_t  uReadAddr,
                         void  *pvBuffer,   
                      uint32_t  uNumBytes);       
//-----------------------------------------------------------------------------
//向指定地址开始写入指定长度的数据               
int MB85RSxx_Write   (uint32_t    uWriteAddr,
                      const void *pvBuffer, 
                      uint32_t    uNumBytes);
// 向指定地址开始写入指定长度的数据               
// 用OS延时
int MB85RSxx_DMAWrite(uint32_t    uWriteAddr,
                      const void *pvBuffer, 
                      uint32_t    uNumBytes);
//-----------------------------------------------------------------------------
// 允许/禁止写入
// iEnabled == TOKEN_WriteFeRAM_Enabled时，允许
void MB85RSxx_EnabledWrite( uint32_t iEnabled );
//-----------------------------------------------------------------------------
// 允许/禁止保持
// iEnabled == TOKEN_WriteFeRAM_Enabled时，允许
void MB85RSxx_EnabledHold ( uint32_t iEnabled );
//-----------------------------------------------------------------------------
// DMA接收完成
void MB85RSxx_DMARxCplt(void);
//-----------------------------------------------------------------------------
// DMA发送完成
void MB85RSxx_DMATxCplt(void);
//-----------------------------------------------------------------------------
#ifdef __cplusplus
}
#endif
//-----------------------------------------------------------------------------
#endif
