//-----------------------------------------------------------------------------
/*
 File        : SD3077.h
 Version     : V1.01
 By          : 银网科技

 Description : SD3077的驱动
        
 Date        : 2018.3.12
 
 v1.2: 2023.12.16 Wey
  修改Init方法
  修改SD3077_ReadState方法
  修改SD3077_ReadSN方法，，返回字符串
  增F32K输出
*/
//-----------------------------------------------------------------------------
#ifndef DRV_SD3077_H
#define DRV_SD3077_H

#include "rtc.h"

#include <stdint.h>
//-----------------------------------------------------------------------------
#ifdef __cplusplus
extern "C" {
#endif
//=============================================================================
// 全局宏
//-----------------------------------------------------------------------------
// RTC状态
#define SD3077_STATE_RTCF        (1 << 0)     // 芯片上电
#define SD3077_STATE_OSF         (1 << 1)     // 停振标志位，OSF=1,表示之前有过停振发生。 
#define SD3077_STATE_BLF         (1 << 2)     // 电池欠压
#define SD3077_STATE_BHF         (1 << 3)     // 电池过压
#define SD3077_STATE_PMF         (1 << 4)     // 当前是电池模式
#define SD3077_STATE_CHARGE      (1 << 5)     // 充电允许
#define SD3077_STATE_F32K        (1 << 6)     // 32K输出允许
//=============================================================================
// 全局方法
//-----------------------------------------------------------------------------
// 初始化
// 0：失败， 其它：芯片ID的hash
uint32_t SD3077_Init(void);
//-----------------------------------------------------------------------------
// 读RTC状态
// 返回：  0 成功   !=0: 失败
int SD3077_ReadState(uint32_t *pState);
//-----------------------------------------------------------------------------
// 读时间  ***只填写时间，无日期！
// 返回：  0 成功   !=0: 失败
int SD3077_GetTime( TDateTimeType *pDateTime );
// 读日期时间
// 返回：  0 成功   !=0: 失败
int SD3077_GetDateTime( TDateTimeType *pDateTime );
// 写时间
// 返回：  0 成功   !=0: 失败
int SD3077_SetDateTime( const TDateTimeType *pDateTime );
//------------------------------------------------------------------------------
// 读回当前温度
// 返回：  0 成功   !=0: 失败
int SD3077_GetTemperature(int* iTemp);

// 读回历史最低温度
// 返回：  0 成功   !=0: 失败
int SD3077_GetLowestTemp( int* iTemp, TDateTimeType *pDateTime );

// 读回历史最高温度
// 返回：  0 成功   !=0: 失败
int SD3077_GetHighestTemp( int* iTemp, TDateTimeType *pDateTime );
//------------------------------------------------------------------------------
// 读电池电压，结果有两位小数
// 返回：  0 成功   !=0: 失败
int SD3077_ReadBVol(int* iVol);
//------------------------------------------------------------------------------
// 读生产序列号
//  pID: 长度不少于8字节的空间
// 返回：  0 成功   !=0: 失败
int SD3077_ReadSN(uint8_t *pID);
//-----------------------------------------------------------------------------
// 写用户内存空间，共70p字节
// 返回：  0 成功   !=0: 失败
int SD3077_ReadMem ( const void* pvData, uint32_t uBytesToRead );
// 读用户内存空间，共70p字节
// 返回：  0 成功   !=0: 失败
int SD3077_WriteMem( const void* pvData, uint32_t uBytesToWrite );
//=============================================================================
#ifdef __cplusplus
}
#endif
//-----------------------------------------------------------------------------
#endif
