//-----------------------------------------------------------------------------
/*
 File        : SPIFlash.h
 Version     : V1.10
 By          : 银网科技

 Description : SPI Flash驱动函数
        
 Date        : 2023.12.05

 2018.12.11 银网科技
   Wey.
   自动检测芯片型号, 并选择读写算法

 2023.12.15 银网科技
   Wey.
   增加ZD25Q系列芯片支持

 2024.10.02 银网科技
   Wey.
   增加W25Q64JV系列芯片支持
*/
//-----------------------------------------------------------------------------
#ifndef DEV_SPIFLASH_H
#define DEV_SPIFLASH_H

#include <stdint.h>
//-----------------------------------------------------------------------------
#ifdef __cplusplus
extern "C" {
#endif
//=============================================================================
// 全局宏
//-----------------------------------------------------------------------------
// 芯片参数
#define SST25VF512        0x10000
#define SST25VF010        0x20000
#define SST25VF020        0x40000
#define SST25VF040        0x80000
#define SST25VF080        0x100000
#define SST25VF016        0x200000
#define SST25VF032        0x400000
#define SST25VF064        0x800000

#define W25Q32JV          0x400000
//-----------------------------------------------------------------------------
// 各芯片的ID
#define SST016_JID        0x00BF2541
#define SST032_JID        0x00BF254A
#define SST064_JID        0x00BF254B
  
#define W25Q32JV_JID      0x00EF4016
#define W25Q64JV_JID      0x00EF4017
#define W25Q128JV_JID     0x00EF4018
#define W25Q256JV_JID     0x00EF4019
//-----------------------------------------------------------------------------
// 操作令牌
#define TOKEN_WriteFLASH_Enabled   0xAA3C55C3
//-----------------------------------------------------------------------------
// 差别JID是否有效?
#define IS_VALID_JID(x)  (SST016_JID == (x) || \
                          SST032_JID == (x) || \
                          SST064_JID == (x) || \
                          W25Q64JV_JID  == (x) || \
                          W25Q128JV_JID == (x))
//=============================================================================
// 全局数据结构
//-----------------------------------------------------------------------------
typedef struct tagFlashParameter
{
  
  uint32_t     Type;            // 芯片型号
  uint32_t     Capacity;        // 容量
  
  uint16_t     NumOfSectors;    // 扇区数量
  uint16_t     SectorSize;      // 扇区尺寸
} TFlashParameter;
//=============================================================================
// 全局方法
//-----------------------------------------------------------------------------
//初始化IIC
void SPIFLASH_Init(void);
//-----------------------------------------------------------------------------
// 从指定地址开始读出指定长度的数据
// 速度50MHz/80Mhz  
uint32_t SPIFLASH_Read( uint32_t  uwReadAddr,
                            void *pvBuffer,   
                        uint32_t  uNumBytes );
//-----------------------------------------------------------------------------
// 从指定扇区读出数据               
uint32_t SPIFLASH_ReadSectors( uint32_t  uSectorNo,
                                   void *pvBuffer, 
                               uint32_t  uNumSectors);
//-----------------------------------------------------------------------------
//向指定地址开始写入指定长度的数据               
uint32_t SPIFLASH_Write(  uint32_t  uWriteAddr,
                        const void *pvBuffer, 
                          uint32_t  uNumBytes);
//-----------------------------------------------------------------------------
// 向指定扇区写入数据               
uint32_t SPIFLASH_WriteSectors(  uint32_t  uSectorNo,
                               const void *pvBuffer, 
                                 uint32_t  uNumSectors );
//-----------------------------------------------------------------------------
// 擦除指定扇区               
uint32_t SPIFLASH_EraseSectors( uint32_t uSectorNo, 
                                uint32_t uNumSectors );
//-----------------------------------------------------------------------------
// 擦除芯片               
uint32_t SPIFLASH_EraseAll( uint32_t uToken );
//-----------------------------------------------------------------------------
// 读取芯片ID
// 正确应返回：   IS_VALID_JID                
uint32_t SPIFLASH_GetID(void);
//-----------------------------------------------------------------------------
// 允许/禁止写入
// uToken == TOKEN_Write_Enabled时，允许
void SPIFLASH_EnabledWrite( uint32_t uToken );
//-----------------------------------------------------------------------------
// 允许/禁止保持
// uToken == TOKEN_Write_Enabled时，允许
void SPIFLASH_EnabledHold( uint32_t uToken );
//-----------------------------------------------------------------------------
//获取芯片参数
void SPIFLASH_GetFlashParam( TFlashParameter *pFP );
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
int DevChk_FlashTest();
//-----------------------------------------------------------------------------
#ifdef __cplusplus
}
#endif
//-----------------------------------------------------------------------------
#endif
