//-----------------------------------------------------------------------------
/*
 File        : DevDebug.h
 Version     : V1.01
 By          : 银网科技

 Description :定义一些调试用的方法
        
 Date       : 2017.9.19
*/
//-----------------------------------------------------------------------------
#ifndef DEV_DEBUG_H
#define DEV_DEBUG_H

#include <stdint.h>
//-----------------------------------------------------------------------------
#ifdef __cplusplus
extern "C" {
#endif
//=============================================================================
// 全局宏
//-----------------------------------------------------------------------------
// 系统内部错误代码
#define GFC_SystemErr   0
#define GFC_OutOfMem    1
#define GFC_EmptyPtr    2
#define GFC_DevType     3
#define GFC_FunType     4
#define GFC_ErrParam    5
#define GFC_ErrRegNum   6
#define GFC_ErrToken    7
#define GFC_ErrValue    8
#define GFC_HardFault   9
//-----------------------------------------------------------------------------
#ifdef __DEBUG
   #define USE_DEV_ASSERT
#endif  
//-----------------------------------------------------------------------------
#ifdef USE_DEV_ASSERT
  // 错误检查并提示
  #define DEV_ASSERT(x, t)  ((x)? DEV_FAULT(t) : 0)
#else
  #define DEV_ASSERT(x, t)  (0)
#endif
//=============================================================================
// 全局数据结构
//-----------------------------------------------------------------------------

//=============================================================================
// 全局数据
//-----------------------------------------------------------------------------

//=============================================================================
// 全局方法
//-----------------------------------------------------------------------------
#ifdef USE_DEV_ASSERT
  #define DEV_FAULT( t )  _Error_Handler( (t), __FILE_NAME__, __LINE__ )

  // 报告出错信息，并锁死装置
  int _Error_Handler(uint32_t uErrType, const char* pFileName, uint32_t uLineNo);
#else
  #define _Error_Handler( e, l )    (0)
#endif
//=============================================================================
#ifdef __cplusplus
}
#endif
//-----------------------------------------------------------------------------
#endif
