//-----------------------------------------------------------------------------
/*
 File        : DevEvtMgr.h
 Version     : V1.10
 By          : 银网科技

 Description :定义事件管理器及相关的数据结构
        
 Date       : 2023.12.05
*/
//-----------------------------------------------------------------------------
#ifndef DEV_EventMgr_H
#define DEV_EventMgr_H

//#include "Dev_Cfg.h"
#include "DevTypes.h"

#include <stdint.h>
//-----------------------------------------------------------------------------
#ifdef __cplusplus
extern "C" {
#endif
//=============================================================================
// 全局宏
//-----------------------------------------------------------------------------
// 新事件标志
// 给各用户
#define NES_SAVE                  0x80000000u
  
// 用于显示
#define NES_DISP                  0x10000000u
  
// CAN口
#define NES_CAN_MASK              0x03000000u
#define NES_CAN1                  0x01000000u
#define NES_CAN2                  0x02000000u
  #define GetCANEvtFilter(n)      (1 << (n + 24))  
  
// 串口
#define NES_UART_MASK             0x000F0000u
#define NES_UART1                 0x00010000u
#define NES_UART2                 0x00020000u
  #define GetUARTEvtFilter(n)     (1 << (n + 16))

// 网口1连接n
#define NES_NETSKT_MASK           0x0000FFFFu
#define NES_NetSocket1            0x00000001u
#define NES_NetSocket2            0x00000002u
#define NES_NetSocket3            0x00000004u
#define NES_NetSocket4            0x00000008u
#define NES_NetSocket5            0x00000010u
#define NES_NetSocket6            0x00000020u
#define NES_NetSocket7            0x00000040u
#define NES_NetSocket8            0x00000080u
  #define GetNetSktEvtFilter(n)   (1 << (n))
//-----------------------------------------------------------------------------
// 事件记录中的动作状态
#define EVENT_TRUE                0x0A
#define EVENT_FALSE               0x00
//-----------------------------------------------------------------------------
// 搜索选项
#define ERD_FORWARD               0x00000000
#define ERD_BACKWARD              0x10000000

#define ERD_CLEARMARK             0x00000001
//=============================================================================
// 全局数据结构
//-----------------------------------------------------------------------------

//=============================================================================
// 全局数据
//-----------------------------------------------------------------------------

//=============================================================================
// 全局方法
//-----------------------------------------------------------------------------
// 初始化报告管理器
void EVTMGR_Init(void);
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// 追加事件记录
// 输入：
//   uRegNum：发生报告的寄存器
//   uAction：报告的行为 TRUE = 0->1;  FALSE = 1->0 
// 返回：无
void EVTMGR_AppendEvent( uint32_t uRegNum, uint32_t uAction );
//-----------------------------------------------------------------------------
// 追加操作记录
// 输入：
//   uRegNum：发生报告的寄存器
//    uValue：操作的结果，操作记录不保存，不显示
// 返回：无
void EVTMGR_AppendOpLog( uint32_t uRegNum, uint32_t uValue );
//-----------------------------------------------------------------------------
// 保存事件记录
void EVTMGR_SaveEvent(void);
//-----------------------------------------------------------------------------
// 统计指定条件的新记录数量
// 输入：
//   uFilter: 过滤条件，NES_xxx，用于各任务只搜索自己需要的事件
// 返回：
//   该过滤条件下可用的新事件数量
uint32_t EVTMGR_GetNewEventCount( uint32_t uFilter );
//-----------------------------------------------------------------------------
// 取指定类型的记录数量
// 输入：
//   uType:  事件类型，mltNew只查NES_DISP, 其它调用EVTMGR_GetNewEventCount
// 返回：
//   该过滤条件下可用的新事件数量
uint32_t EVTMGR_GetEventCount( TEventLogType uType );
//-----------------------------------------------------------------------------
// 取指定类型的历史记录
// 输入：
//    uType:  事件类型
//   uIndex： 事件序号
//   pEvent:  存贮事件空间
// 返回：
//   null=读取失败，others=读取成功
const TEventLogItem* EVTMGR_GetEventItem( TEventLogType  uType,
                                               uint32_t  uIndex,
                                          TEventLogItem *pEvent );
//-----------------------------------------------------------------------------
// 读取事件描述
uint32_t EVTMGR_GetEventDesp( TEventWithProperty *pEvent );
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
// 清全部新事件标志
// 输入：
//   uFilter: 过滤条件，NES_xxx，用于各任务只搜索自己需要的事件
// 返回： 无
void EVTMGR_ClearNewEventMarks( uint32_t uFilter );
//-----------------------------------------------------------------------------
// 取走新记录
// 按 旧到新的时间顺序， 记录取走后该标志被清除
// 输入：
//   uFilter: 过滤条件，NES_xxx，用于各任务只搜索自己需要的事件
// 返回：
//   搜索到的事件记录
const TEventLogItem* EVTMGR_Fetch( uint32_t uFilter );
//-----------------------------------------------------------------------------
// 从前向后搜索新记录
// 输入：
//    uFilter: 过滤条件，NES_xxx，用于各任务只搜索自己需要的事件
//    uOffset: 从指定方向找第几条有效的记录  0~ SIZE_EVENT_CACHE-1
//   uOptions: 指定搜索任务的工作方式  ERD_xxx宏
//             ERD_FORWARD：  向前 即从缓冲区中时间最老的记录开始
//             ERD_BACKWARD： 向后 即从缓冲区中时间最新的记录开始 
//             ERD_CLEARMARK：设置=清除(将来取不到了) 不置=清除(将来还可以再取)
// 返回：
//   搜索到的事件记录
const TEventLogItem* EVTMGR_Search( uint32_t uFilter, 
                                    uint32_t uOffset, 
                                    uint32_t uOptions );
//=============================================================================
#ifdef __cplusplus
}
#endif
//-----------------------------------------------------------------------------
#endif
