//-----------------------------------------------------------------------------
/*
 File        : DevIntf.h
 Version     : V1.01
 By          : 银网科技

 Description :定义访问系统功能的接口
              TDevInterface 可作为GUI/COM的基类，提供直接访问系统功能的接口

 Date       : 2017.12.6
*/
//-----------------------------------------------------------------------------
#ifndef DEV_Inferface_H
#define DEV_Inferface_H

#include "DevTypes.h"
//-----------------------------------------------------------------------------
#ifdef __cplusplus
extern "C" {
#endif
#include <cstdint>
//=============================================================================
// 全局宏
//-----------------------------------------------------------------------------
// 操作令牌
#define TOKEN_INTF_OPERATE   (0x3ACC55A3u)
//-----------------------------------------------------------------------------
// MCU状态标识
#define MCU_WDTOK    (1 << 0)    // WDT Enabled
#define MCU_FRONLY   (1 << 1)    // Flash ReadOnly
#define MCU_BOOT     (1 << 2)    // Boot exists
//-----------------------------------------------------------------------------

//=============================================================================
// 全局数据结构
//-----------------------------------------------------------------------------

//=============================================================================
// 全局数据
//-----------------------------------------------------------------------------

//=============================================================================
// 全局对象
//-----------------------------------------------------------------------------

//=============================================================================
// 全局方法
//-----------------------------------------------------------------------------
// 初始化
void DevIntf_Init(void);
//_____________________________________________________________________________
//-----------------------------------------------------------------------------
// MCU访问
//-----------------------------------------------------------------------------
// 复位MCU
// 输入:
//   uToken: 令牌
// 输出：(无)
// 返回：(无)
void DevIntf_ResetMCU(uint32_t uToken);
//-----------------------------------------------------------------------------
// 读取MCU状态
// 输入：（无）
// 输出：（无）
// 返回：
//   MCU的状态
uint32_t DevIntf_GetMCUState(void);
//-----------------------------------------------------------------------------
// 重新配置装置硬件
//   1.对某些外设（如UART\NIC等）参数做过设置，需要重新配置这些外设
//   2.对某些外设（如DI\DO等）进行了测试，需要恢复
// 输入：（无）
// 输出：（无）
// 返回：（无）
void DevIntf_PeripheralsReconfig(void);
//_____________________________________________________________________________
//-----------------------------------------------------------------------------
// 装置功能类型
//-----------------------------------------------------------------------------
// 取装置功能类型
// 输入：（无）
// 输出：（无）
// 返回：（无）
uint8_t DevIntf_GetDevFunc(void);
//_____________________________________________________________________________
//-----------------------------------------------------------------------------
// 寄存器访问
//-----------------------------------------------------------------------------
// 获取指定寄存器的描述信息
// 输入:
//   uRegNum: 寄存器地址
// 输出：(无)
// 返回：
//   0 = 指定寄存器无描述信息   else = 指定寄存器的信息描述
const TDevRegInfoItem* DevIntf_GetRegInfo(uint32_t uRegNum);
//-----------------------------------------------------------------------------
// 获取寄存器属性列表
// 输入:
//   regClass: 数据类别
// 输出：(无)
// 返回：
//   0 = 无指定类别属性列表   else 指定类别的属性列表
const TDevRegInfoList* DevIntf_GetRegsList(TDevRegListClass regClass);
//-----------------------------------------------------------------------------
// 事件相关
//-----------------------------------------------------------------------------
// 取事件的属性
// 输入:
//   uEvtType: 事件处理方式
// 输出：(无)
// 返回：
//   0 = 不可识别的属性  else 指定的事件处理属性
const TEventProperty*  DevIntf_GetEvtProp(uint32_t uEvtType);
//_____________________________________________________________________________
//-----------------------------------------------------------------------------
// 参数维护管理
//-----------------------------------------------------------------------------
// 允许定值修改
// 输入: (无)
// 输出：(无)
// 返回：(无)
void DevIntf_ServiceEnable(void);
//-----------------------------------------------------------------------------
// 禁止定值修改
// 输入: (无)
// 输出：(无)
// 返回：(无)
void DevIntf_ServiceDisable(void);
//-----------------------------------------------------------------------------
// 保存定值
// 输入: (无)
// 输出：(无)
// 返回：(无)
void DevIntf_ServiceAccept(void);
//-----------------------------------------------------------------------------
// 放弃编辑的定值
// 输入: (无)
// 输出：(无)
// 返回：(无)
void DevIntf_ServiceCancel(void);
//-----------------------------------------------------------------------------
// 查询设定值是否被编辑
// 输入: (无)
// 输出：(无)
// 返回： RGEDIT_CFG_MODIFIED\RGEDIT_HLD_MODIFIED
uint32_t DevIntf_GetServiceModfied(void);
//=============================================================================
// 保护定值区管理
//-----------------------------------------------------------------------------
// 获取当前编辑区号
// 输入: (无)
// 输出：(无)
// 返回：当前编辑的定值区序号
uint32_t DevIntf_GetEditBlockNo(void);
//-----------------------------------------------------------------------------
// 切换编辑定值区
// 输入:
//  uToken: 令牌 必须是 TOKEN_INTF_OPERATE
//   uDest: 目标定值区
// 输出：(无)
// 返回：
//   0:成功  -1：无效区号  1:运行区重复  2:当前区
int DevIntf_ChangeEditHoldingBlock( uint32_t uToken, uint32_t uDest );
//-----------------------------------------------------------------------------
// 获取当前运行的定值区号
// 输入: (无)
// 输出：(无)
// 返回：当前运行的定值区序号
uint32_t DevIntf_GetActiveBlockNo(void);
//-----------------------------------------------------------------------------
// 切换当前运行区
// 输入:
//  uToken:  令牌  必须是 TOKEN_INTF_OPERATE
//   uDest: 目标定值区
// 输出：(无)
// 返回：
//   0:成功  -1：无效区号  1:运行区重复  2:当前区
int DevIntf_ChangeActiveHoldingBlock( uint32_t uToken, uint32_t uDest );
//-----------------------------------------------------------------------------
// 当前编辑区的定值恢复到默认值
// 填写 DefValue 到各定值寄存器，并保存到NvRAM
// 输入: (无)
// 输出：(无)
// 返回：0:成功   >0: 失败
uint32_t DevIntf_HoldingLoadDefault(uint32_t uToken);
//-----------------------------------------------------------------------------
// 当前编辑区的定值复制到
// 输入:
//  uToken:  令牌 必须是 TOKEN_INTF_OPERATE
//   uDest: 目标定值区
// 输出：(无)
// 返回：
//   0:成功  -1：无效区号  1:运行区重复  2:当前区
int DevIntf_HoldingCopyTo( uint32_t uToken, uint32_t uDest );
//=============================================================================
// 保护定值区管理
//-----------------------------------------------------------------------------
// 设备参数恢复到当前值
// 用设备参数区的值覆盖设备参数编辑区
// 输入: (无)
// 输出：(无)
// 返回：0:成功   >0: 失败
uint32_t DevIntf_DevCfgEditPropare(uint32_t uToken);
//-----------------------------------------------------------------------------
// 设备参数恢复到默认值
// 填写 DefValue 到各设备参数寄存器，并保存到NvRAM
// 输入: (无)
// 输出：(无)
// 返回：0:成功   >0: 失败
uint32_t DevIntf_DevCfgLoadDefault(uint32_t uToken);
//_____________________________________________________________________________
//-----------------------------------------------------------------------------
// 时间访问
//-----------------------------------------------------------------------------
// 读取系统时间
// 从系统中读取读取当前时间
// 输入：(无)
// 输出：
//   pDateTime: 指向存贮当前时间的结构指针
// 返回：(无)
void DevIntf_getDateTime(TDateTimeType* pDateTime);
//-----------------------------------------------------------------------------
// 读取系统时间
// 从SFC中读取读取当前时间
// 输入：(无)
// 输出：
//   puwTime: 指向存贮当前时间的空间，不少于 7 Words
// 返回：(无)
void DevIntf_ReadDateTime(uint16_t *puwTime);
//-----------------------------------------------------------------------------
// 设置系统时间
// 设置当前时钟到给定日期日间
// 输入：
//   puwTime: 指向存贮当前时间的空间，不少于 7 Words
//    uToken：令牌
// 输出：
// 返回：(无)
void DevIntf_SetDateTime(uint16_t *puwTime, uint32_t uToken);
//-----------------------------------------------------------------------------
// 取系统时脉
// 取系统自上电以来的毫秒数
// 输入：(无)
// 输出：(无)
// 返回：(无)
//   系统自上电以来的毫秒数
uint32_t DevIntf_GetTickCount(void);
//-----------------------------------------------------------------------------
// 计算相对时间(ms)
// 计算从uStart到当前的毫秒数
// 输入：
//   uStart: 开始时刻，可由DevIntf_GetTickCount获得
// 输出：
// 返回：
//   从uStart到当前的毫秒数
uint32_t DevIntf_DiffTimeMs(uint32_t uStart);
//=============================================================================
// 看门狗
//-----------------------------------------------------------------------------
// 启动
// 输入：(无)
// 输出：(无)
// 返回：(无)
void DevIntf_StartDog(void);
//-----------------------------------------------------------------------------
// 看门狗 喂狗
// 输入：(无)
// 输出：(无)
// 返回：(无)
void DevIntf_FeedDog(void);
//=============================================================================
#ifdef __cplusplus
}
#endif
//-----------------------------------------------------------------------------
#endif
