//-----------------------------------------------------------------------------
/*
 File        : DevRegInfoList.h
 Version     : V1.01
 By          : 银网科技

 Description :定义设备参数寄存器描述列表

   卫荣平
   2017.9.12
*/
//-----------------------------------------------------------------------------
#ifndef DEV_REGINFOLIST_H
#define DEV_REGINFOLIST_H

#include "DevTypes.h"
#include "DevRegInfo.h"
//-----------------------------------------------------------------------------
#ifdef __cplusplus
extern "C" {
#endif
//=============================================================================
// 全局宏
//-----------------------------------------------------------------------------

//=============================================================================
// 全局变量
//-----------------------------------------------------------------------------
// LVCC保护数据寄存器描述表
extern const TDevRegInfoList SUTCProtDataRegInfoList;
//-----------------------------------------------------------------------------
// LVCC测量数据寄存器描述表
extern const TDevRegInfoList SUTCMeasDataRegInfoList;
//-----------------------------------------------------------------------------
// 设备配置寄存器描述表
extern const TDevRegInfoList DevOptionRegInfoList;
//-----------------------------------------------------------------------------
// 系统状态寄存器描述表
extern const TDevRegInfoList SysStateRegInfoList;
//-----------------------------------------------------------------------------
// 设备参数寄存器描述表
extern const TDevRegInfoList DevConfigRegInfoList;
//-----------------------------------------------------------------------------
// 设备参数寄存器描述表
extern const TDevRegInfoList EventReportRegInfoList;
//-----------------------------------------------------------------------------
// 设备级功能寄存器描述表
extern const TDevRegInfoList DevFunctionRegInfoList;
////---------------------------------------------------------------------------
//// 开入别名寄存器描述表
//extern const TDevRegInfoList DevCfgDIAliasRegInfoList;
//-----------------------------------------------------------------------------
// 开入状态寄存器描述表
extern const TDevRegInfoList StateDigitaInputRegInfoList; 
//-----------------------------------------------------------------------------
// 开入功能状态寄存器描述表
extern const TDevRegInfoList StateDIFuncRegInfoList;
//-----------------------------------------------------------------------------
// 开出状态寄存器描述表
extern const TDevRegInfoList StateRelayOutputRegInfoList;
////---------------------------------------------------------------------------
//// 直流测量结果寄存器描述表
//extern const TDevRegInfoList DCInputMeasureRegInfos;
//-----------------------------------------------------------------------------
//// 开入传动寄存器描述表
//extern const TDevRegInfoList DigInputTestRegInfos;
////-----------------------------------------------------------------------------
//// 开出传动寄存器描述表
//extern const TDevRegInfoList RelayOutputTestRegInfoList;
//-----------------------------------------------------------------------------
// LVCC的事件报告属性
extern const TEventPropertyList SUTCEventPropertys;
//-----------------------------------------------------------------------------
// 软遥信寄存器描述表
extern const TDevRegInfoList ProtSignRegInfoList;
//=============================================================================
//-----------------------------------------------------------------------------
#ifdef __cplusplus
}
#endif
//-----------------------------------------------------------------------------
#endif // DEV_REGINFOLIST_H
